[
    {
        "name": "Aatrox",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Deathbringer Stance) heals Aatrox on his empowered basic attacks. E (Umbral Dash) passively grants omnivamp, which is significantly increased during R (World Ender). R (World Ender) also greatly increases Aatrox's self-healing."
            },
            {
                "name": "Knock-up",
                "details": "Q (The Darkin Blade) knocks up enemies hit by the edge of its impact zone on all three casts."
            },
            {
                "name": "High Mobility",
                "details": "E (Umbral Dash) provides a short dash that can be used to reposition during his Q casts. R (World Ender) grants a significant burst of decaying movement speed, which is refreshed upon champion takedowns, allowing for extended chases and repositioning in fights."
            }
        ]
    },
    {
        "name": "Ahri",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "R (Spirit Rush) allows Ahri to dash up to three times, providing significant repositioning and chase potential."
            }
        ]
    },
    {
        "name": "Akali",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "W (Twilight Shroud) makes Akali invisible while she is inside the smoke cloud."
            },
            {
                "name": "High Mobility",
                "details": "E (Shuriken Flip) allows Akali to dash twice, and R (Perfect Execution) provides two dashes. W (Twilight Shroud) also grants a burst of movement speed."
            }
        ]
    },
    {
        "name": "Akshan",
        "archetype": "Diver",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Dirty Fighting) grants Akshan a shield every three hits from his attacks and abilities if the target was a champion."
            },
            {
                "name": "Invisibility",
                "details": "W (Going Rogue) active allows Akshan to become camouflaged, making him invisible to enemies outside of a certain range or true sight."
            },
            {
                "name": "High Mobility",
                "details": "Akshan's kit features multiple sources of mobility: his Passive (Dirty Fighting) grants move speed on canceling an attack, Q (Avengerang) grants move speed on champion hit, W (Going Rogue) grants move speed while camouflaged towards Scoundrels, and E (Heroic Swing) allows him to grapple and swing around terrain."
            }
        ]
    },
    {
        "name": "Alistar",
        "archetype": "Vanguard",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Pulverize) smashes the ground, knocking up nearby enemies."
            },
            {
                "name": "Cleanse",
                "details": "R (Unbreakable Will) immediately cleanses all disabling effects on Alistar."
            },
            {
                "name": "Unstoppable",
                "details": "R (Unbreakable Will) makes Alistar immune to crowd control effects for its duration after the initial cleanse."
            }
        ]
    },
    {
        "name": "Amumu",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle",
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Anivia",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Annie",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "E (Molten Shield) grants Annie or an ally a shield for a duration."
            }
        ]
    },
    {
        "name": "Aphelios",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": []
    },
    {
        "name": "Ashe",
        "archetype": "Marksman",
        "primary_position": [
            "Bot",
            "Support"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "E (Hawkshot) sends a hawk spirit that grants vision over an area, revealing units and terrain."
            }
        ]
    },
    {
        "name": "Aurelion Sol",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "E (Comet of Legend) allows Aurelion Sol to fly across long distances, providing significant map mobility for repositioning and roaming."
            },
            {
                "name": "Knock-up",
                "details": "R (Voice of Light) projects a blast of starfire that knocks back enemies caught in it to his outer limit."
            }
        ]
    },
    {
        "name": "Azir",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "E (Shifting Sands) grants Azir a shield for a brief duration as he dashes."
            },
            {
                "name": "High Mobility",
                "details": "E (Shifting Sands) allows Azir to dash to one of his Sand Soldiers. If he hits an enemy champion, he instantly readies a new Sand Soldier, enabling further repositioning."
            },
            {
                "name": "Knock-up",
                "details": "R (Emperor's Divide) summons a wall of soldiers that charges forward, knocking back enemies."
            }
        ]
    },
    {
        "name": "Bard",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Caretaker's Shrine) creates healing shrines that power up over time, providing significant health restoration to allies."
            },
            {
                "name": "High Mobility",
                "details": "E (Magical Journey) creates portals through terrain for quick traversal. His passive (Traveler's Call) grants out-of-combat movement speed upon collecting Chimes, enabling extensive roaming."
            }
        ]
    },
    {
        "name": "Blitzcrank",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Mana Barrier) grants Blitzcrank a shield based on his mana when he drops to low health."
            },
            {
                "name": "Knock-up",
                "details": "E (Power Fist) causes Blitzcrank's next attack to knock up the target."
            },
            {
                "name": "Shield Reave",
                "details": "R (Static Field) active destroys nearby enemies' shields."
            }
        ]
    },
    {
        "name": "Brand",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Braum",
        "archetype": "Warden",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Projectile Block",
                "details": "E (Unbreakable) raises his shield, intercepting and destroying all incoming projectiles from a direction."
            },
            {
                "name": "Knock-up",
                "details": "R (Glacial Fissure) slams the ground, knocking up enemies in an area and along a line."
            }
        ]
    },
    {
        "name": "Caitlyn",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "W (Yordle Snap Trap) grants True Sight of enemies rooted by the trap for 3 seconds. R (Ace in the Hole) grants True Sight of the target during its channel."
            }
        ]
    },
    {
        "name": "Camille",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Adaptive Defenses) grants a shield against the damage type of the enemy champion after hitting them with a basic attack."
            },
            {
                "name": "Knock-up",
                "details": "E (Hookshot) knocks up enemy champions upon landing its second cast."
            },
            {
                "name": "High Mobility",
                "details": "E (Hookshot) allows Camille to dash to and from terrain, providing significant mobility and engagement potential."
            },
            {
                "name": "Knock-up",
                "details": "R (The Hextech Ultimatum) knocks away other nearby enemies when Camille leaps onto her target."
            }
        ]
    },
    {
        "name": "Cassiopeia",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Anti-Dash",
                "details": "W (Miasma) grounds enemies, preventing them from using movement abilities."
            },
            {
                "name": "High Sustain",
                "details": "E (Twin Fang) heals Cassiopeia for a percentage of the damage dealt, especially when spammed on poisoned targets."
            }
        ]
    },
    {
        "name": "Cho'Gath",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Carnivore) restores Health and Mana whenever Cho'Gath kills a unit."
            },
            {
                "name": "Knock-up",
                "details": "Q (Rupture) knocks up enemies in a target area."
            }
        ]
    },
    {
        "name": "Corki",
        "archetype": "Marksman",
        "primary_position": [
            "Mid",
            "Bot"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "Q (Phosphorus Bomb) reveals enemies in the area for a duration."
            },
            {
                "name": "High Mobility",
                "details": "Passive (The Package) grants significant movement speed. W (Valkyrie) is a dash, and with The Package, W (Special Delivery) becomes a much longer dash, granting significant mobility and a knock-aside effect."
            },
            {
                "name": "Knock-up",
                "details": "Empowered W (Special Delivery) from The Package knocks aside enemies hit."
            }
        ]
    },
    {
        "name": "Darius",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Decimate) heals Darius for a percentage of his missing health per enemy champion and large jungle monster hit by the blade."
            },
            {
                "name": "Knock-up",
                "details": "E (Apprehend) actively pulls and knocks up enemies."
            }
        ]
    },
    {
        "name": "Diana",
        "archetype": "Diver",
        "primary_position": [
            "Mid",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "Q (Crescent Strike) afflicts enemies with Moonlight, revealing them if they are not stealthed. R (Moonfall) reveals nearby enemies."
            },
            {
                "name": "Shielding",
                "details": "W (Pale Cascade) creates orbiting spheres and grants Diana a temporary shield, which gains additional strength and refreshes duration if all spheres detonate."
            },
            {
                "name": "High Mobility",
                "details": "E (Lunar Rush) is a dash that has its cooldown reset if used on an enemy afflicted with Moonlight, allowing for repeated dashes."
            }
        ]
    },
    {
        "name": "Draven",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "W (Blood Rush) grants significant decaying movement speed that can be refreshed by catching Spinning Axes, allowing for continuous repositioning."
            },
            {
                "name": "Knock-up",
                "details": "E (Stand Aside) knocks enemies aside, displacing them and applying a slow."
            }
        ]
    },
    {
        "name": "Dr. Mundo",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "R (Maximum Dosage) instantly heals a percentage of missing Health and then regenerates a large portion of his maximum Health over a long duration. Passive (Goes Where He Pleases) provides significantly increased Health regeneration and restores Health when picking up chemical cannisters. W (Heart Zapper) restores Health based on stored gray health."
            },
            {
                "name": "Cleanse",
                "details": "Passive (Goes Where He Pleases) resists the first immobilizing effect that hits him, effectively cleansing it."
            }
        ]
    },
    {
        "name": "Ekko",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Parallel Convergence) grants a shield to Ekko when he enters its anomaly zone."
            },
            {
                "name": "High Mobility",
                "details": "E (Phase Dive) is a dash that allows Ekko to close gaps, and his passive (Z-Drive Resonance) grants a burst of movement speed upon proccing."
            }
        ]
    },
    {
        "name": "Elise",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": []
    },
    {
        "name": "Evelynn",
        "archetype": "Burst",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "Passive (Demon Shade) grants Camouflage after level 6, allowing Evelynn to remain unseen by enemies outside of a small detection radius."
            }
        ]
    },
    {
        "name": "Ezreal",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "E (Arcane Shift) allows Ezreal to teleport to a nearby location, and its cooldown is significantly reduced by hitting Q (Mystic Shot), enabling frequent repositioning and kiting."
            }
        ]
    },
    {
        "name": "Fiddlesticks",
        "archetype": "Catcher",
        "primary_position": [
            "Jungle",
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Bountiful Harvest) drains health from nearby enemies, restoring a percentage of damage dealt as Health."
            }
        ]
    },
    {
        "name": "Fiora",
        "archetype": "Diver",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "Projectile Block",
                "details": "W (Riposte) parries all incoming damage and disables for a short time, blocking projectiles."
            },
            {
                "name": "Unstoppable",
                "details": "W (Riposte) makes Fiora immune to all incoming disables for a short duration."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "W (Riposte) parries all incoming damage for a short duration, effectively dodging auto attacks."
            },
            {
                "name": "High Sustain",
                "details": "R (Grand Challenge) provides significant area-of-effect healing to Fiora and her allies upon successfully hitting all Vitals or killing the challenged target. Her passive (Duelist's Dance) also provides healing when hitting Vitals."
            },
            {
                "name": "High Mobility",
                "details": "Q (Lunge) is a low-cooldown dash that can be reset. Her passive (Duelist's Dance) and R (Grand Challenge) grant movement speed bonuses when hitting Vitals or near a challenged target, allowing for high combat mobility."
            }
        ]
    },
    {
        "name": "Fizz",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Q (Urchin Strike) is a dash through an enemy, and E (Playful/Trickster) allows Fizz to hop onto his trident, becoming untargetable, and then either land or dash again."
            },
            {
                "name": "Knock-up",
                "details": "R (Chum the Waters) causes a shark to erupt, knocking up the target with the fish."
            },
            {
                "name": "True Sight",
                "details": "R (Chum the Waters) afflicts the victim with True Sight."
            }
        ]
    },
    {
        "name": "Galio",
        "archetype": "Warden",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Shield of Durand) passively grants Galio a magic shield. R (Hero's Entrance) grants a magic shield to allies in the landing zone."
            },
            {
                "name": "Knock-up",
                "details": "E (Justice Punch) knocks up the first enemy champion hit. R (Hero's Entrance) knocks up enemies upon landing."
            }
        ]
    },
    {
        "name": "Gangplank",
        "archetype": "Burst",
        "primary_position": [
            "Top",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Cleanse",
                "details": "W (Remove Scurvy) removes all disabling crowd control effects."
            },
            {
                "name": "High Sustain",
                "details": "W (Remove Scurvy) restores a significant amount of health, scaling with missing health."
            }
        ]
    },
    {
        "name": "Garen",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Perseverance) regenerates a percentage of his total health each second when out of combat."
            },
            {
                "name": "Cleanse",
                "details": "Q (Decisive Strike) removes all slowing effects on Garen upon activation."
            },
            {
                "name": "Shielding",
                "details": "W (Courage) grants Garen a shield upon activation."
            }
        ]
    },
    {
        "name": "Gnar",
        "archetype": "Vanguard",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Mini Gnar's W (Hyper) grants movement speed on every third attack or ability, and his E (Hop) is a leap that can be extended by bouncing off units. Mega Gnar's E (Crunch) is also a leap, providing significant repositioning."
            },
            {
                "name": "Knock-up",
                "details": "Mega Gnar's R (GNAR!) tosses nearby enemies, knocking them back and making them airborne. If they hit a wall, they are stunned."
            }
        ]
    },
    {
        "name": "Gragas",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "E (Body Slam) knocks up enemies it collides with. R (Explosive Cask) knocks away enemies from the impact zone."
            }
        ]
    },
    {
        "name": "Graves",
        "archetype": "Marksman",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "E (Quickdraw) is a dash that reloads a shell and grants armor, with its cooldown significantly reduced by basic attacks, allowing for frequent repositioning."
            }
        ]
    },
    {
        "name": "Gwen",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (A Thousand Cuts) heals Gwen for a portion of the bonus magic damage dealt to champions."
            }
        ]
    },
    {
        "name": "Hecarim",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Spirit of Dread) heals Hecarim for a percentage of damage dealt to enemies within its radius by him and his allies."
            },
            {
                "name": "High Mobility",
                "details": "E (Devastating Charge) grants a significant burst of movement speed, and R (Onslaught of Shadows) is a long-range dash, allowing Hecarim to quickly engage and traverse the map."
            },
            {
                "name": "Knock-up",
                "details": "E (Devastating Charge)'s empowered attack knocks the target back."
            }
        ]
    },
    {
        "name": "Heimerdinger",
        "archetype": "Artillery",
        "primary_position": [
            "Mid",
            "Top",
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Illaoi",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Prophet of an Elder God) and Tentacle slams heal Illaoi when they damage enemy champions, providing significant sustain in fights."
            }
        ]
    },
    {
        "name": "Irelia",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Q (Bladesurge) allows Irelia to dash to enemies, and its cooldown resets if the target is marked or dies, enabling multiple rapid dashes."
            },
            {
                "name": "High Sustain",
                "details": "Q (Bladesurge) heals Irelia upon striking a target, and its cooldown reset allows for repeated healing in skirmishes and lane."
            },
            {
                "name": "Unstoppable",
                "details": "W (Defiant Dance) makes Irelia immune to crowd control during its channel, as indicated by the ally tip."
            }
        ]
    },
    {
        "name": "Ivern",
        "archetype": "Enchanter",
        "primary_position": [
            "Jungle",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "E (Triggerseed) grants a shield to an ally champion."
            },
            {
                "name": "Knock-up",
                "details": "R (Daisy!)'s third consecutive attack on the same champion creates a shockwave that knocks up enemies."
            }
        ]
    },
    {
        "name": "Janna",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Howling Gale) summons a tornado that knocks up enemies in its path."
            },
            {
                "name": "Shielding",
                "details": "E (Eye of the Storm) grants an ally champion or turret a shield."
            },
            {
                "name": "High Mobility",
                "details": "Passive (Tailwind) grants Janna and nearby allied champions bonus Move Speed when moving towards allied champions. W (Zephyr) passively grants Janna bonus Move Speed and Ghosting."
            }
        ]
    },
    {
        "name": "Jarvan IV",
        "archetype": "Diver",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Dragon Strike) combined with E (Demacian Standard) allows Jarvan IV to pull himself to the standard, knocking up enemies in his path."
            },
            {
                "name": "High Mobility",
                "details": "Jarvan IV's Q (Dragon Strike) combined with E (Demacian Standard) provides a significant dash for engage and ganking. His R (Cataclysm) is also a powerful leap, making mobility central to his kit."
            }
        ]
    },
    {
        "name": "Jax",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Anti-Auto Attack",
                "details": "E (Counter Strike) allows Jax to dodge all incoming basic attacks for a short duration."
            }
        ]
    },
    {
        "name": "Jayce",
        "archetype": "Burst",
        "primary_position": [
            "Top",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Passive (Hextech Capacitor) and R (Mercury Cannon / Mercury Hammer) grant movement speed upon swapping weapons. Q (To the Skies!) in Hammer Stance is a dash. E (Acceleration Gate) in Cannon Stance provides a movement speed buff to allies passing through it."
            },
            {
                "name": "Knock-up",
                "details": "E (Thundering Blow) in Hammer Stance knocks back the target."
            }
        ]
    },
    {
        "name": "Jhin",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": []
    },
    {
        "name": "Jinx",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "W (Zap!) reveals the first enemy hit for a short duration."
            }
        ]
    },
    {
        "name": "Kai'Sa",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "W (Void Seeker) grants True Sight of the first enemy hit."
            },
            {
                "name": "High Mobility",
                "details": "E (Supercharge) grants significant Move Speed, and R (Killer Instinct) is a targeted dash, allowing for aggressive repositioning and kiting."
            },
            {
                "name": "Invisibility",
                "details": "E (Supercharge), when evolved, grants Invisibility for a short duration."
            },
            {
                "name": "Shielding",
                "details": "R (Killer Instinct) grants a shield upon dashing to an enemy champion."
            }
        ]
    },
    {
        "name": "Kalista",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Kalista's passive, Martial Poise, allows her to dash a short distance after every basic attack or Pierce (Q), making her highly mobile in combat."
            },
            {
                "name": "True Sight",
                "details": "W (Sentinel) sends a ghost that patrols an area, revealing champions it spots for 4 seconds."
            },
            {
                "name": "Knock-up",
                "details": "R (Fate's Call) allows Kalista's Oathsworn to launch themselves, knocking back and knocking up all nearby enemies upon impact with a champion."
            }
        ]
    },
    {
        "name": "Karma",
        "archetype": "Enchanter",
        "primary_position": [
            "Support",
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "W (Focused Resolve) reveals the tethered target for 2 seconds."
            },
            {
                "name": "Shielding",
                "details": "E (Inspire) grants a shield to an allied champion. Mantra E strengthens the initial shield and applies Inspire to nearby allied champions."
            }
        ]
    },
    {
        "name": "Karthus",
        "archetype": "Battlemage",
        "primary_position": [
            "Jungle",
            "Mid"
        ],
        "mechanics": []
    },
    {
        "name": "Kassadin",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Q (Null Sphere) grants Kassadin a temporary magic shield after casting."
            },
            {
                "name": "High Mobility",
                "details": "R (Riftwalk) is a low-cooldown teleport ability that can be cast multiple times in quick succession, providing high mobility."
            }
        ]
    },
    {
        "name": "Katarina",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Katarina's E (Shunpo) allows her to blink to targets, and its cooldown is significantly reduced by picking up daggers from Q, W, and her passive, as well as by champion takedowns. Her W (Preparation) also grants a burst of movement speed."
            },
            {
                "name": "Grievous Wounds",
                "details": "Katarina's R (Death Lotus) applies 60% Grievous Wounds to enemies hit for 3 seconds, reducing their healing and regeneration."
            }
        ]
    },
    {
        "name": "Kayle",
        "archetype": "Marksman",
        "primary_position": [
            "Top",
            "Mid"
        ],
        "mechanics": []
    },
    {
        "name": "Kayn",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "W (Blade's Reach) in Darkin Slayer form additionally knocks up enemies hit."
            },
            {
                "name": "High Mobility",
                "details": "E (Shadow Step) allows Kayn to walk through terrain with increased movement speed for an extended duration, providing unique ganking and repositioning capabilities."
            },
            {
                "name": "High Sustain",
                "details": "In Darkin form, Kayn's passive heals for a percentage of spell damage dealt to champions, and R (Umbral Trespass) in Darkin form restores a significant amount of health."
            }
        ]
    },
    {
        "name": "Kennen",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Passive (Mark of the Storm) stuns enemies after 3 hits from Kennen's abilities."
            },
            {
                "name": "High Mobility",
                "details": "E (Lightning Rush) grants significant movement speed and allows Kennen to pass through units, enabling rapid engagement and repositioning."
            }
        ]
    },
    {
        "name": "Kha'Zix",
        "archetype": "Burst",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "Evolved W (Void Spike) reveals enemy champions hit for 2 seconds."
            },
            {
                "name": "Invisibility",
                "details": "R (Void Assault) makes Kha'Zix invisible for a short duration, with an increased duration and an additional use when evolved."
            },
            {
                "name": "High Mobility",
                "details": "E (Leap) is a dash that resets its cooldown on champion takedowns when evolved. R (Void Assault) grants increased movement speed and allows for repositioning with its invisibility."
            }
        ]
    },
    {
        "name": "Kindred",
        "archetype": "Marksman",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Wolf's Frenzy) passive heals Kindred based on missing health with attacks. R (Lamb's Respite) heals all units inside the zone when the effect ends."
            },
            {
                "name": "High Mobility",
                "details": "Q (Dance of Arrows) allows Kindred to tumble a short distance, firing arrows. Its cooldown is significantly reduced while inside W (Wolf's Frenzy), enabling frequent repositioning and kiting."
            }
        ]
    },
    {
        "name": "Kled",
        "archetype": "Diver",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "Grievous Wounds",
                "details": "Q (Bear Trap on a Rope) applies Grievous Wounds if the target remains shackled for a short duration."
            },
            {
                "name": "High Mobility",
                "details": "E (Jousting) is a dash that can be recast if it hits an enemy champion or large monster. R (Chaaaaaaaarge!!!) is a very long-range charge that grants movement speed."
            },
            {
                "name": "Shielding",
                "details": "R (Chaaaaaaaarge!!!) grants Kled a shield while charging and for a short duration after."
            },
            {
                "name": "Knock-up",
                "details": "R (Chaaaaaaaarge!!!) briefly knocks back the first enemy champion Skaarl rams."
            },
            {
                "name": "High Sustain",
                "details": "Kled's passive (Skaarl, the Cowardly Lizard) allows him to remount Skaarl upon gaining full courage, restoring a significant portion of Skaarl's health and effectively giving him a second health bar."
            }
        ]
    },
    {
        "name": "Kog'Maw",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "R (Living Artillery) reveals enemies hit for 2 seconds."
            }
        ]
    },
    {
        "name": "LeBlanc",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "Passive (Mirror Image) makes LeBlanc invisible for 1 second when she drops below 40% Health."
            },
            {
                "name": "High Mobility",
                "details": "W (Distortion) allows LeBlanc to dash to a location and then reactivate to return to her starting point, providing significant repositioning and escape potential."
            },
            {
                "name": "True Sight",
                "details": "E (Ethereal Chains) grants True Sight on the shackled target."
            }
        ]
    },
    {
        "name": "Lee Sin",
        "archetype": "Diver",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "Q (Sonic Wave) grants True Sight of the first enemy hit."
            },
            {
                "name": "High Sustain",
                "details": "W (Iron Will) grants Lee Sin Life Steal and Spell Vamp for 4 seconds."
            },
            {
                "name": "Shielding",
                "details": "W (Safeguard) shields Lee Sin and a target allied champion."
            },
            {
                "name": "High Mobility",
                "details": "Q (Resonating Strike) allows Lee Sin to dash to an enemy, and W (Safeguard) allows him to dash to an ally or ward, providing significant mobility."
            },
            {
                "name": "Knock-up",
                "details": "R (Dragon's Rage) knocks back a target and knocks up any enemies they collide with."
            }
        ]
    },
    {
        "name": "Leona",
        "archetype": "Vanguard",
        "primary_position": [
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Lillia",
        "archetype": "Battlemage",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Q (Blooming Blows) passively grants stacking Move Speed when hitting enemies with spells, allowing her to kite and chase effectively."
            }
        ]
    },
    {
        "name": "Lissandra",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid"
        ],
        "mechanics": []
    },
    {
        "name": "Lucian",
        "archetype": "Marksman",
        "primary_position": [
            "Bot",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "W (Ardent Blaze) briefly reveals enemies hit by the explosion."
            },
            {
                "name": "High Mobility",
                "details": "E (Relentless Pursuit) is a dash whose cooldown is significantly reduced by hitting enemies with his passive (Lightslinger) attacks, allowing for frequent repositioning."
            }
        ]
    },
    {
        "name": "Lulu",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "E (Help, Pix!) grants a shield to an allied champion."
            },
            {
                "name": "True Sight",
                "details": "E (Help, Pix!) grants True Sight on an enemy champion it hits."
            },
            {
                "name": "Knock-up",
                "details": "R (Wild Growth) knocks up surrounding enemies when cast on an ally."
            }
        ]
    },
    {
        "name": "Lux",
        "archetype": "Artillery",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Prismatic Barrier) grants a shield to allies it passes through, and again on its return."
            },
            {
                "name": "True Sight",
                "details": "E (Lucent Singularity) reveals the area where it is cast."
            }
        ]
    },
    {
        "name": "Malphite",
        "archetype": "Vanguard",
        "primary_position": [
            "Top",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Granite Shield) provides a shield based on max health that recharges out of combat."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "E (Ground Slam) reduces the attack speed of enemies hit for a short duration."
            },
            {
                "name": "Unstoppable",
                "details": "R (Unstoppable Force) makes Malphite unstoppable during his dash."
            },
            {
                "name": "Knock-up",
                "details": "R (Unstoppable Force) knocks up enemies at the end of the dash."
            }
        ]
    },
    {
        "name": "Malzahar",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Unstoppable",
                "details": "Passive (Void Shift) grants crowd control immunity when he hasn't recently taken damage or been crowd controlled."
            }
        ]
    },
    {
        "name": "Maokai",
        "archetype": "Vanguard",
        "primary_position": [
            "Top",
            "Jungle",
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Sap Magic) heals Maokai on basic attacks, with the cooldown reduced each time he casts a spell or is struck by an enemy's spell."
            },
            {
                "name": "Knock-up",
                "details": "Q (Bramble Smash) knocks back nearby enemies."
            }
        ]
    },
    {
        "name": "Master Yi",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Q (Alpha Strike) allows Master Yi to teleport to enemies, becoming untargetable. R (Highlander) grants a significant increase in movement speed."
            },
            {
                "name": "High Sustain",
                "details": "W (Meditate) allows Master Yi to channel, restoring a significant amount of health over time, especially when at low health."
            }
        ]
    },
    {
        "name": "Miss Fortune",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "W (Strut) passively grants significant bonus movement speed when out of combat, and can be activated for an immediate burst of speed and attack speed."
            }
        ]
    },
    {
        "name": "Wukong",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "W (Warrior Trickster) makes Wukong invisible for a short duration."
            },
            {
                "name": "Knock-up",
                "details": "R (Cyclone) knocks up enemies caught in its spin."
            },
            {
                "name": "High Mobility",
                "details": "W (Warrior Trickster) and E (Nimbus Strike) are dashes, and R (Cyclone) grants movement speed, allowing Wukong to quickly engage and reposition."
            }
        ]
    },
    {
        "name": "Mordekaiser",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Indestructible) stores damage taken and dealt to create a shield, enhancing his durability."
            },
            {
                "name": "High Sustain",
                "details": "W (Indestructible) allows Mordekaiser to consume his active shield to restore a portion of his health, providing significant in-fight sustain."
            }
        ]
    },
    {
        "name": "Morgana",
        "archetype": "Catcher",
        "primary_position": [
            "Support",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "P (Soul Siphon) heals Morgana for a percentage of the damage she deals to champions, large minions, and medium/larger jungle monsters."
            },
            {
                "name": "Unstoppable",
                "details": "E (Black Shield) grants an ally champion a magic shield that also prevents all disabling and immobilizing effects until it breaks."
            },
            {
                "name": "Shielding",
                "details": "E (Black Shield) grants an ally champion a magic shield."
            }
        ]
    },
    {
        "name": "Nami",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Ebb and Flow) heals allied champions, providing sustain in lane and teamfights."
            },
            {
                "name": "Knock-up",
                "details": "Q (Aqua Prison) knocks up and stuns enemies in an area."
            },
            {
                "name": "Knock-up",
                "details": "R (Tidal Wave) summons a large wave that knocks up enemies in its path."
            }
        ]
    },
    {
        "name": "Nasus",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Soul Eater) grants bonus Life Steal, allowing him to sustain in lane and fights."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "W (Wither) significantly reduces an enemy champion's Attack Speed."
            }
        ]
    },
    {
        "name": "Nautilus",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Titan's Wrath) grants Nautilus a temporary shield."
            },
            {
                "name": "Knock-up",
                "details": "R (Depth Charge) fires a shockwave that knocks up enemies it passes through and the primary target."
            }
        ]
    },
    {
        "name": "Neeko",
        "archetype": "Catcher",
        "primary_position": [
            "Mid",
            "Support",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "W (Shapesplitter) makes Neeko invisible for a short duration."
            },
            {
                "name": "Shielding",
                "details": "R (Pop Blossom) grants Neeko a shield while she prepares to leap and stun."
            }
        ]
    },
    {
        "name": "Nidalee",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "E (Primal Surge) in human form heals Nidalee or an ally, with increased healing based on missing health."
            },
            {
                "name": "True Sight",
                "details": "Passive (Prowl) grants True Sight on targets hit by Javelin Toss (Q) or Bushwhack (W). W (Bushwhack) also reveals enemies who trigger the trap."
            },
            {
                "name": "High Mobility",
                "details": "W (Pounce) in cougar form is a low-cooldown dash that can be reset on Hunted targets. Her passive (Prowl) grants significant movement speed when moving through brush and towards Hunted targets."
            }
        ]
    },
    {
        "name": "Nocturne",
        "archetype": "Diver",
        "primary_position": [
            "Jungle",
            "Mid"
        ],
        "mechanics": []
    },
    {
        "name": "Nunu & Willump",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Consume) allows Nunu & Willump to heal significantly by biting minions, monsters, or champions, with increased healing when low on health."
            },
            {
                "name": "Knock-up",
                "details": "W (Biggest Snowball Ever!) knocks up enemies it collides with, with the duration scaling with distance rolled."
            },
            {
                "name": "High Mobility",
                "details": "W (Biggest Snowball Ever!) allows Nunu & Willump to roll a snowball that gains speed, providing high mobility for ganks and engagements."
            },
            {
                "name": "Shielding",
                "details": "R (Absolute Zero) grants Nunu & Willump a powerful shield while channeling the blizzard."
            }
        ]
    },
    {
        "name": "Olaf",
        "archetype": "Juggernaut",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Vicious Strikes) grants Olaf Life Steal and increases all healing received based on his missing Health, allowing him to sustain through combat."
            },
            {
                "name": "Unstoppable",
                "details": "R (Ragnarok) removes all existing crowd control effects on Olaf and makes him immune to new ones for its duration."
            }
        ]
    },
    {
        "name": "Orianna",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "E (Command: Protect) grants a shield to an allied champion (or Orianna herself) for a duration."
            },
            {
                "name": "Knock-up",
                "details": "R (Command: Shockwave) launches nearby enemies towards the Ball after a short delay."
            }
        ]
    },
    {
        "name": "Ornn",
        "archetype": "Vanguard",
        "primary_position": [
            "Top",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Unstoppable",
                "details": "W (Bellows Breath) makes Ornn Unstoppable while he breathes fire."
            },
            {
                "name": "Knock-up",
                "details": "E (Searing Charge) knocks up enemies if Ornn collides with terrain. R (Call of the Forge God) knocks up enemies when Ornn recasts it and charges into the elemental. Ornn's basic attacks against Brittle targets (applied by W and R) also knock them back."
            }
        ]
    },
    {
        "name": "Pantheon",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Projectile Block",
                "details": "E (Aegis Assault) makes Pantheon immune to non-tower damage from the front, which includes projectiles."
            }
        ]
    },
    {
        "name": "Poppy",
        "archetype": "Vanguard",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Iron Ambassador) grants Poppy a temporary shield when she picks up her buckler."
            },
            {
                "name": "Anti-Dash",
                "details": "W (Steadfast Presence) creates a field that stops enemy dashes, grounding and slowing them."
            },
            {
                "name": "Knock-up",
                "details": "R (Keeper's Verdict) can be released immediately for an uncharged swing that knocks up enemies."
            }
        ]
    },
    {
        "name": "Pyke",
        "archetype": "Catcher",
        "primary_position": [
            "Support",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Gift of the Drowned Ones) allows Pyke to regenerate a significant amount of damage taken from champions when he is hidden from enemies."
            },
            {
                "name": "Knock-up",
                "details": "Q (Bone Skewer) when held, pulls the first enemy hit towards Pyke, displacing them."
            },
            {
                "name": "Invisibility",
                "details": "W (Ghostwater Dive) grants Pyke Camouflage, making him invisible to enemies outside a certain range."
            },
            {
                "name": "High Mobility",
                "details": "W (Ghostwater Dive) grants significant decaying movement speed. E (Phantom Undertow) is a dash. R (Death From Below) allows Pyke to blink to targets within an X-shaped area."
            }
        ]
    },
    {
        "name": "Qiyana",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "Q (Elemental Wrath / Edge of Ixtal) with Wild Enchantment (from brush) makes Qiyana invisible."
            },
            {
                "name": "High Mobility",
                "details": "W (Terrashape) allows Qiyana to dash to terrain, and E (Audacity) allows her to dash through enemies. These abilities, combined with Q resets, provide high mobility for repositioning and engaging."
            },
            {
                "name": "Knock-up",
                "details": "R (Supreme Display of Talent) launches a shockwave that Knocks Back enemies and stuns them when it detonates against terrain."
            }
        ]
    },
    {
        "name": "Quinn",
        "archetype": "Marksman",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "Anti-Auto Attack",
                "details": "Q (Blinding Assault) disarms non-champion targets, preventing them from auto-attacking."
            },
            {
                "name": "True Sight",
                "details": "W (Heightened Senses) actively reveals a large area, granting vision."
            },
            {
                "name": "High Mobility",
                "details": "E (Vault) is a dash, and R (Behind Enemy Lines) grants massive movement speed, allowing for rapid map traversal and repositioning."
            },
            {
                "name": "Knock-up",
                "details": "E (Vault) slightly knocks back the target upon impact."
            }
        ]
    },
    {
        "name": "Rakan",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Gleaming Quill) heals Rakan and nearby allies after hitting a champion or epic monster."
            },
            {
                "name": "Shielding",
                "details": "Passive (Fey Feathers) periodically grants Rakan a shield. E (Battle Dance) shields an allied champion."
            },
            {
                "name": "Knock-up",
                "details": "W (Grand Entrance) knocks up nearby enemies on arrival."
            },
            {
                "name": "High Mobility",
                "details": "W (Grand Entrance) is a dash. E (Battle Dance) is a dash to an allied champion, which can be recast. R (The Quickness) grants a significant movement speed buff."
            }
        ]
    },
    {
        "name": "Rammus",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "R (Soaring Slam) knocks up enemies near the center if cast while Rammus is in Q (Powerball)."
            },
            {
                "name": "High Mobility",
                "details": "Q (Powerball) grants Rammus a significant burst of movement speed, allowing for rapid engagements and map traversal."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "W (Defensive Ball Curl) causes Rammus to return damage to enemies that basic attack him, punishing auto-attack reliant champions."
            }
        ]
    },
    {
        "name": "Rek'Sai",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Fury of the Xer'Sai) allows Rek'Sai to restore health while Burrowed by consuming Fury."
            },
            {
                "name": "True Sight",
                "details": "W (Burrow) reveals the positions of nearby moving enemies. Q (Prey Seeker) reveals enemies hit."
            },
            {
                "name": "Knock-up",
                "details": "W (Un-burrow) knocks up nearby enemies."
            },
            {
                "name": "High Mobility",
                "details": "E (Tunnel) creates reusable tunnels for map traversal. W (Burrow) grants increased movement speed."
            },
            {
                "name": "Unstoppable",
                "details": "R (Void Rush) makes Rek'Sai briefly untargetable and then she leaps unstoppably at her target."
            }
        ]
    },
    {
        "name": "Rell",
        "archetype": "Vanguard",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shield Reave",
                "details": "Q (Shattering Strike) destroys all incoming shields on enemies hit."
            },
            {
                "name": "Shielding",
                "details": "W (Ferromancy: Crash Down) grants Rell a large shield upon dismounting."
            },
            {
                "name": "Knock-up",
                "details": "W (Ferromancy: Crash Down) knocks up enemies when Rell dismounts."
            }
        ]
    },
    {
        "name": "Renata Glasc",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Handshake) can be recast to throw an enemy, stunning them if they collide with another champion."
            },
            {
                "name": "Shielding",
                "details": "E (Loyalty Program) grants a shield to allies hit by the missiles."
            }
        ]
    },
    {
        "name": "Renekton",
        "archetype": "Diver",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Cull the Meek) heals Renekton for a portion of damage dealt, with increased healing when empowered by Fury."
            },
            {
                "name": "Shield Reave",
                "details": "Empowered W (Ruthless Predator) slashes three times, destroying damage shields on the target before dealing damage and stunning."
            },
            {
                "name": "High Mobility",
                "details": "E (Slice and Dice) allows Renekton to dash, and if he hits an enemy, he can recast it to dash a second time, providing significant engage and disengage."
            }
        ]
    },
    {
        "name": "Rengar",
        "archetype": "Diver",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Battle Roar) heals Rengar for a percentage of the damage he has recently taken."
            },
            {
                "name": "Cleanse",
                "details": "Empowered W (Battle Roar) cleanses Rengar of all crowd control effects."
            },
            {
                "name": "Invisibility",
                "details": "R (Thrill of the Hunt) grants Rengar Camouflage, making him invisible to enemies outside a certain range."
            },
            {
                "name": "True Sight",
                "details": "R (Thrill of the Hunt) grants True Sight in a small area around the nearest enemy champion, revealing them."
            },
            {
                "name": "High Mobility",
                "details": "Passive (Unseen Predator) allows Rengar to leap from brush. His ultimate (Thrill of the Hunt) grants significant movement speed and allows leaps without brush, enabling rapid engagements and repositioning."
            }
        ]
    },
    {
        "name": "Riven",
        "archetype": "Diver",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Broken Wings) can be reactivated twice, with the third cast knocking up nearby enemies."
            },
            {
                "name": "High Mobility",
                "details": "Q (Broken Wings) provides three short dashes, and E (Valor) provides another dash, allowing for frequent repositioning and engagement."
            },
            {
                "name": "Shielding",
                "details": "E (Valor) grants a shield for 1.5 seconds upon activation, crucial for trading and survivability."
            }
        ]
    },
    {
        "name": "Rumble",
        "archetype": "Battlemage",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Scrap Shield) grants Rumble a temporary shield, with increased strength when in the Danger Zone."
            }
        ]
    },
    {
        "name": "Ryze",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Q (Overload)'s passive grants a significant burst of movement speed when Ryze casts Overload with 2 runes charged, which is a frequent occurrence in his spell rotation."
            }
        ]
    },
    {
        "name": "Samira",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "Projectile Block",
                "details": "W (Blade Whirl) destroys any enemy missiles that enter its area."
            },
            {
                "name": "High Mobility",
                "details": "E (Wild Rush) is a dash that resets on takedowns. Her passive (Daredevil Impulse) allows her to dash to immobilized enemies."
            },
            {
                "name": "High Sustain",
                "details": "R (Inferno Trigger) applies lifesteal at 100% effectiveness for the duration of the ability."
            }
        ]
    },
    {
        "name": "Sejuani",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Unstoppable",
                "details": "Passive (Fury of the North) grants immunity to slows after being out of combat."
            },
            {
                "name": "Knock-up",
                "details": "Q (Arctic Assault) knocks enemies into the air upon impact."
            }
        ]
    },
    {
        "name": "Senna",
        "archetype": "Marksman",
        "primary_position": [
            "Bot",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "R (Dawning Shadow) grants a shield to allied champions hit by the global beam."
            },
            {
                "name": "Invisibility",
                "details": "E (Curse of the Black Mist) grants camouflage (invisibility) to Senna and allied champions who enter the mist."
            }
        ]
    },
    {
        "name": "Seraphine",
        "archetype": "Enchanter",
        "primary_position": [
            "Support",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Surround Sound) grants a shield to Seraphine and nearby allied champions."
            },
            {
                "name": "High Sustain",
                "details": "W (Surround Sound) restores missing health to nearby allied champions if Seraphine is already shielded."
            }
        ]
    },
    {
        "name": "Sett",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle",
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Pit Grit) grants increased health regeneration based on Sett's missing health."
            },
            {
                "name": "Shielding",
                "details": "W (Haymaker) consumes stored Grit to generate a decaying shield."
            },
            {
                "name": "Knock-up",
                "details": "R (The Show Stopper) grabs an enemy champion and slams them into the ground, knocking them up and damaging/slowing nearby enemies."
            }
        ]
    },
    {
        "name": "Shaco",
        "archetype": "Burst",
        "primary_position": [
            "Jungle",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "Q (Deceive) makes Shaco invisible for a short duration, allowing him to reposition and initiate attacks."
            },
            {
                "name": "High Mobility",
                "details": "Q (Deceive) is a short-range teleport on a relatively low cooldown, providing Shaco with frequent repositioning and escape options."
            }
        ]
    },
    {
        "name": "Shen",
        "archetype": "Warden",
        "primary_position": [
            "Top",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Ki Barrier) grants Shen a shield after casting an ability. R (Stand United) grants a shield to a targeted allied champion."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "W (Spirit's Refuge) creates a zone that blocks all basic attacks against Shen and his allies within it."
            }
        ]
    },
    {
        "name": "Shyvana",
        "archetype": "Diver",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "R (Dragon's Descent) knocks enemies towards her target location as she flies."
            }
        ]
    },
    {
        "name": "Singed",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "Anti-Dash",
                "details": "W (Mega Adhesive) grounds enemies who walk on it, preventing them from using movement abilities."
            },
            {
                "name": "Grievous Wounds",
                "details": "R (Insanity Potion) causes Singed's Poison Trail to apply 40% Grievous Wounds to enemies hit."
            }
        ]
    },
    {
        "name": "Sion",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle",
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Glory in Death) allows Sion to reanimate after death, gaining rapid attacks that heal him significantly."
            },
            {
                "name": "Shielding",
                "details": "W (Soul Furnace) grants Sion a substantial shield for 6 seconds."
            },
            {
                "name": "Knock-up",
                "details": "Q (Decimating Smash) knocks up enemies if charged for at least 1 second. R (Unstoppable Onslaught) knocks up enemies upon collision, based on distance charged."
            },
            {
                "name": "Unstoppable",
                "details": "R (Unstoppable Onslaught) makes Sion unstoppable during his charge."
            }
        ]
    },
    {
        "name": "Sivir",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": []
    },
    {
        "name": "Skarner",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Crystalline Exoskeleton) grants Skarner a shield."
            }
        ]
    },
    {
        "name": "Sona",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Aria of Perseverance) heals Sona and a nearby allied champion."
            },
            {
                "name": "Shielding",
                "details": "W (Aria of Perseverance) grants a temporary shield to allied champions within her aura."
            }
        ]
    },
    {
        "name": "Soraka",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Starcall) heals Soraka when hitting an enemy champion. W (Astral Infusion) heals a targeted ally. R (Wish) globally heals all allied champions."
            }
        ]
    },
    {
        "name": "Swain",
        "archetype": "Battlemage",
        "primary_position": [
            "Support",
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Ravenous Flock) heals Swain upon collecting Soul Fragments. His ultimate, R (Demonic Ascension), drains health from nearby enemies, providing significant healing."
            },
            {
                "name": "True Sight",
                "details": "W (Vision of Empire) reveals enemy champions hit by the ability for several seconds."
            }
        ]
    },
    {
        "name": "Sylas",
        "archetype": "Diver",
        "primary_position": [
            "Mid",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Kingslayer) heals Sylas significantly against enemy champions, with increased healing based on his missing health."
            },
            {
                "name": "Knock-up",
                "details": "E (Abduct) knocks up the first enemy hit for 0.35 seconds."
            }
        ]
    },
    {
        "name": "Syndra",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": []
    },
    {
        "name": "Tahm Kench",
        "archetype": "Warden",
        "primary_position": [
            "Support",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Tongue Lash) heals Tahm Kench for a percentage of his missing health when striking an enemy champion. E (Thick Skin) passively stores damage taken as Gray Health, which rapidly heals him when out of combat."
            },
            {
                "name": "Knock-up",
                "details": "W (Abyssal Dive) allows Tahm Kench to dive down and re-appear at a target location, knocking up all enemies in the area."
            },
            {
                "name": "Shielding",
                "details": "E (Thick Skin) active converts all stored Gray Health into a temporary shield. R (Devour) grants a significant shield to devoured allied champions."
            },
            {
                "name": "Cleanse",
                "details": "R (Devour) can devour an allied champion, making them untargetable and effectively removing them from ongoing crowd control or dangerous situations."
            }
        ]
    },
    {
        "name": "Taliyah",
        "archetype": "Battlemage",
        "primary_position": [
            "Jungle",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "W (Seismic Shove) causes an area of ground to erupt, knocking back enemies in a chosen direction."
            },
            {
                "name": "Anti-Dash",
                "details": "E (Unraveled Earth) creates a minefield that detonates and damages enemies who dash or are knocked through the stones."
            }
        ]
    },
    {
        "name": "Talon",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "E (Assassin's Path) allows Talon to vault over any terrain or structure with a low cooldown, enabling rapid map traversal. R (Shadow Assault) grants bonus movement speed and invisibility for repositioning and engaging/disengaging."
            },
            {
                "name": "Invisibility",
                "details": "R (Shadow Assault) makes Talon invisible for a duration, allowing him to escape or reposition for an attack."
            }
        ]
    },
    {
        "name": "Taric",
        "archetype": "Warden",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Starlight's Touch) heals nearby allied champions based on charges stored."
            },
            {
                "name": "Shielding",
                "details": "W (Bastion) actively shields an ally and grants them bonus armor."
            }
        ]
    },
    {
        "name": "Teemo",
        "archetype": "Burst",
        "primary_position": [
            "Top",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Anti-Auto Attack",
                "details": "Q (Blinding Dart) blinds the target, causing their auto attacks to miss for the duration."
            },
            {
                "name": "High Mobility",
                "details": "W (Move Quick) passively grants increased movement speed and can be activated for a burst of movement speed that is not lost when struck."
            },
            {
                "name": "True Sight",
                "details": "R (Noxious Trap) reveals enemies who step on the trap for its duration."
            },
            {
                "name": "Invisibility",
                "details": "Passive (Guerrilla Warfare) grants Teemo Invisibility after standing still for a short duration, or while moving in brush."
            }
        ]
    },
    {
        "name": "Thresh",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "Q (Death Sentence) grants True Sight on the first unit hit for the duration of the pull."
            },
            {
                "name": "Shielding",
                "details": "W (Dark Passage) throws a lantern that shields Thresh and up to one allied champion."
            },
            {
                "name": "Knock-up",
                "details": "E (Flay) sweeps chains, knocking all enemies hit in the direction of the swing (pull or push)."
            }
        ]
    },
    {
        "name": "Tristana",
        "archetype": "Marksman",
        "primary_position": [
            "Bot",
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "W (Rocket Jump) allows Tristana to leap to a location, and its cooldown resets on champion takedowns or when Explosive Charge detonates on a champion at max stacks, enabling multiple jumps in combat."
            },
            {
                "name": "Knock-up",
                "details": "R (Buster Shot) fires a massive cannonball that knocks back the target and surrounding enemies."
            }
        ]
    },
    {
        "name": "Trundle",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (King's Tribute) heals Trundle for a percentage of an enemy unit's maximum Health when it dies nearby. W (Frozen Domain) further increases all healing received while Trundle is within the area."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "Q (Chomp) reduces the target's Attack Damage for a short duration."
            },
            {
                "name": "High Mobility",
                "details": "W (Frozen Domain) grants a significant boost to Move Speed while Trundle is within the area, enabling chases and engagements."
            },
            {
                "name": "Knock-up",
                "details": "E (Pillar of Ice) briefly knocks back enemies directly over its creation point."
            }
        ]
    },
    {
        "name": "Tryndamere",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Bloodlust) allows Tryndamere to consume Fury to heal a significant amount of health, which is crucial for his lane sustain and dueling."
            },
            {
                "name": "Anti-Auto Attack",
                "details": "W (Mocking Shout) reduces the Attack Damage of nearby enemies, significantly mitigating their auto-attack damage."
            }
        ]
    },
    {
        "name": "Twisted Fate",
        "archetype": "Catcher",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "R (Destiny) grants True Sight of all enemy champions on the map."
            }
        ]
    },
    {
        "name": "Twitch",
        "archetype": "Marksman",
        "primary_position": [
            "Bot",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Invisibility",
                "details": "Q (Ambush) makes Twitch Camouflaged for a short duration, allowing him to move undetected by most enemies."
            }
        ]
    },
    {
        "name": "Udyr",
        "archetype": "Juggernaut",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "W (Turtle Stance) active grants Udyr a temporary shield that absorbs damage."
            },
            {
                "name": "High Sustain",
                "details": "W (Turtle Stance) passive heals Udyr for a percentage of his maximum health on his first and every third attack."
            }
        ]
    },
    {
        "name": "Urgot",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "E (Disdain) grants Urgot a shield for a few seconds when he charges forward."
            }
        ]
    },
    {
        "name": "Varus",
        "archetype": "Artillery",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "Grievous Wounds",
                "details": "E (Hail of Arrows) applies 40% Grievous Wounds to enemies in the desecrated area, reducing their healing and regeneration."
            }
        ]
    },
    {
        "name": "Vayne",
        "archetype": "Marksman",
        "primary_position": [
            "Bot",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "Q (Tumble) provides a short-range dash with a low cooldown. Her passive (Night Hunter) grants bonus movement speed towards enemy champions, which is enhanced by her R (Final Hour), which also reduces Tumble's cooldown."
            },
            {
                "name": "Invisibility",
                "details": "R (Final Hour) causes her Q (Tumble) to grant invisibility for a short duration."
            }
        ]
    },
    {
        "name": "Veigar",
        "archetype": "Burst",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Vel'Koz",
        "archetype": "Artillery",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "E (Tectonic Disruption) knocks up enemies in an area."
            }
        ]
    },
    {
        "name": "Vex",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Anti-Dash",
                "details": "Passive (Doom 'n Gloom) causes Vex's next basic ability to interrupt enemy dashes when empowered."
            },
            {
                "name": "Shielding",
                "details": "W (Personal Space) grants Vex a shield."
            }
        ]
    },
    {
        "name": "Vi",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Vault Breaker) knocks back the primary target. R (Cease and Desist) knocks up the primary target and knocks aside secondary targets."
            },
            {
                "name": "Unstoppable",
                "details": "R (Cease and Desist) makes Vi unstoppable while dashing towards her target."
            }
        ]
    },
    {
        "name": "Viego",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Viego's Q passive heals him for a percentage of damage dealt on his second attack against an enemy, and his passive heals him for a percentage of the target's max health upon possessing a fallen enemy."
            },
            {
                "name": "Invisibility",
                "details": "Viego's E (Harrowed Path) grants him Camouflage while inside the Black Mist, making him invisible to enemies outside a certain range."
            },
            {
                "name": "High Mobility",
                "details": "Viego's W (Spectral Maw) allows him to dash forward, his E (Harrowed Path) grants him bonus movement speed while in the mist, and his R (Heartbreaker) allows him to teleport to a nearby location."
            },
            {
                "name": "Knock-up",
                "details": "Viego's R (Heartbreaker) knocks back other nearby enemies when he teleports and attacks a target."
            }
        ]
    },
    {
        "name": "Viktor",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Q (Siphon Power) grants Viktor a shield upon casting, which is increased when upgraded."
            }
        ]
    },
    {
        "name": "Vladimir",
        "archetype": "Battlemage",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Transfusion) drains life from enemies to heal Vladimir, and its empowered version heals for an additional percentage of missing health. W (Sanguine Pool) heals Vladimir for a percentage of damage dealt to enemies in the pool. R (Hemoplague) heals Vladimir for each enemy champion hit upon detonation."
            },
            {
                "name": "Projectile Block",
                "details": "W (Sanguine Pool) makes Vladimir untargetable and allows him to dodge incoming projectiles and abilities."
            }
        ]
    },
    {
        "name": "Volibear",
        "archetype": "Diver",
        "primary_position": [
            "Top",
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "W (Frenzied Maul) heals Volibear for a significant amount of missing health when cast a second time on a marked target."
            },
            {
                "name": "Shielding",
                "details": "E (Sky Splitter) grants Volibear a shield if he is within the lightning bolt's blast radius."
            }
        ]
    },
    {
        "name": "Warwick",
        "archetype": "Diver",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Eternal Hunger) heals Warwick for damage dealt by basic attacks, with increased healing at low health. Q (Jaws of the Beast) heals for a percentage of damage dealt, and R (Infinite Duress) heals for 100% of damage dealt during the channel."
            },
            {
                "name": "High Mobility",
                "details": "W (Blood Hunt) grants significant movement speed towards low-health enemies. Q (Jaws of the Beast) allows Warwick to follow enemy dashes/flashes if held. R (Infinite Duress) is a long-range leap that scales with movement speed."
            }
        ]
    },
    {
        "name": "Xayah",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": []
    },
    {
        "name": "Xerath",
        "archetype": "Artillery",
        "primary_position": [
            "Mid",
            "Support"
        ],
        "mechanics": []
    },
    {
        "name": "Xin Zhao",
        "archetype": "Diver",
        "primary_position": [
            "Jungle"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Three Talon Strike) knocks up the target on the third attack."
            },
            {
                "name": "Knock-up",
                "details": "R (Crescent Guard) knocks back all non-Challenged enemies."
            }
        ]
    },
    {
        "name": "Yasuo",
        "archetype": "Diver",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Way of the Wanderer) grants a shield after moving, which triggers upon taking damage from a champion or monster."
            },
            {
                "name": "Knock-up",
                "details": "Q (Steel Tempest) at 2 stacks fires a whirlwind that knocks enemies Airborne."
            },
            {
                "name": "Projectile Block",
                "details": "W (Wind Wall) creates a drifting wall of wind that blocks all enemy projectiles."
            },
            {
                "name": "High Mobility",
                "details": "E (Sweeping Blade) allows Yasuo to dash through enemies, providing high mobility, especially when chaining dashes through multiple targets."
            },
            {
                "name": "Knock-up",
                "details": "R (Last Breath) blinks to an Airborne enemy and holds all nearby Airborne enemies in the air for an additional second."
            }
        ]
    },
    {
        "name": "Yone",
        "archetype": "Diver",
        "primary_position": [
            "Mid",
            "Top"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Mortal Steel) at 2 stacks dashes Yone forward with a gust of wind, knocking enemies Airborne. R (Fate Sealed) strikes enemies along a path, knocking them up towards Yone."
            },
            {
                "name": "Shielding",
                "details": "W (Spirit Cleave) grants Yone a shield, with the value increasing for each champion hit."
            },
            {
                "name": "High Mobility",
                "details": "E (Soul Unbound) allows Yone's spirit to leave his body, gaining ramping Move Speed. R (Fate Sealed) causes Yone to blink behind the last champion hit."
            }
        ]
    },
    {
        "name": "Yorick",
        "archetype": "Juggernaut",
        "primary_position": [
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Q (Last Rites) heals Yorick on hit, with increased healing if he is below 50% Health, providing significant sustain in lane and during fights."
            }
        ]
    },
    {
        "name": "Yuumi",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Shielding",
                "details": "Passive (Bop 'n' Block) grants a shield to Yuumi or her attached ally when she attacks a champion."
            },
            {
                "name": "High Sustain",
                "details": "E (Zoomies) provides significant healing to Yuumi or her attached ally."
            }
        ]
    },
    {
        "name": "Zac",
        "archetype": "Vanguard",
        "primary_position": [
            "Jungle",
            "Top"
        ],
        "mechanics": [
            {
                "name": "High Sustain",
                "details": "Passive (Cell Division) allows Zac to restore Health by picking up goo chunks shed from his abilities. His ultimate also enhances this healing."
            },
            {
                "name": "Knock-up",
                "details": "Q (Stretching Strikes) can knock up two enemies if they collide. E (Elastic Slingshot) knocks up enemies where Zac lands. R (Let's Bounce!) knocks up enemies with the first bounce."
            },
            {
                "name": "High Mobility",
                "details": "E (Elastic Slingshot) allows Zac to charge and launch himself over very long distances, enabling powerful ganks and engages from unexpected angles."
            }
        ]
    },
    {
        "name": "Zed",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "W (Living Shadow) allows Zed to dash and then swap positions with his shadow. R (Death Mark) also involves a dash to the target and leaves a shadow for repositioning."
            }
        ]
    },
    {
        "name": "Zeri",
        "archetype": "Marksman",
        "primary_position": [
            "Bot"
        ],
        "mechanics": [
            {
                "name": "Shield Reave",
                "details": "Passive (Living Battery) allows Zeri to absorb energy and shield herself when she damages an enemy shield."
            },
            {
                "name": "Shielding",
                "details": "Passive (Living Battery) allows Zeri to shield herself when she damages an enemy shield."
            },
            {
                "name": "High Mobility",
                "details": "E (Spark Surge) is a dash that can be greatly extended by vaulting over terrain, and its cooldown is reduced by hitting champions. R (Lightning Crash) grants stacking Move Speed that refreshes and gets stronger every time she hits an enemy champion."
            }
        ]
    },
    {
        "name": "Ziggs",
        "archetype": "Artillery",
        "primary_position": [
            "Mid",
            "Bot"
        ],
        "mechanics": []
    },
    {
        "name": "Zilean",
        "archetype": "Enchanter",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "Knock-up",
                "details": "Q (Time Bomb) stuns enemies for 1.1-1.5 seconds if a second bomb is placed on a unit that already has one, detonating the first bomb immediately."
            }
        ]
    },
    {
        "name": "Zoe",
        "archetype": "Burst",
        "primary_position": [
            "Mid"
        ],
        "mechanics": [
            {
                "name": "High Mobility",
                "details": "W (Spell Thief) grants a burst of movement speed when Zoe casts a summoner spell. R (Portal Jump) allows Zoe to blink to a nearby position and back, enabling repositioning and dodging."
            }
        ]
    },
    {
        "name": "Zyra",
        "archetype": "Catcher",
        "primary_position": [
            "Support"
        ],
        "mechanics": [
            {
                "name": "True Sight",
                "details": "W (Rampant Growth) seeds grant True Sight of enemy champions that step on them."
            },
            {
                "name": "Knock-up",
                "details": "R (Stranglethorns) knocks up enemies within its area after 2 seconds."
            }
        ]
    }
]